---
kind: other
id: Methods.T:Autodesk.Revit.DB.PrintSetup
source: html/69fca804-1e10-075e-4bcd-080d0cad5d91.htm
---
# PrintSetup Methods

Delete the current print setting, and make the In-Session setting as the current one.